https://github.com/mit-ddig/multitask-patients

*** result summary
note: * uses 109 features, whereas else uses 29 features in paper
note: not hyper param tuned; follows hyperparam setting in the paper
| Careunit | Global* keras | Global keras | Global PyTorch |  MTL keras | MoE PyTorch |
|----------+---------------+--------------+----------------+------------+-------------|
| CCU      |    0.89225404 |   0.85479242 |     0.84983647 | 0.85038713 |  0.84728341 |
| CSRU     |    0.91068841 |   0.92871377 |     0.90606884 | 0.84927536 |  0.91571558 |
| MICU     |    0.84140579 |   0.82596592 |     0.82414306 | 0.81366257 |  0.83084407 |
| SICU     |    0.86747082 |   0.83960198 |     0.84718137 | 0.85340036 |  0.84548411 |
| TSICU    |    0.88863892 |   0.88397544 |       0.893982 | 0.88282715 |   0.8958802 |
|----------+---------------+--------------+----------------+------------+-------------|
| Macro    |    0.88009159 |   0.86660991 |     0.86424235 | 0.84991051 |  0.86704147 |
| Micro    |    0.88057511 |   0.86591873 |     0.86361049 |  0.8540471 |  0.86614556 |

same table but less precision
note: * uses 109 features, whereas else uses 29 features in paper
note: not hyper param tuned; follows hyperparam setting in the paper
| Careunit | Global* keras | Global keras | Global PyTorch | MTL keras | MoE PyTorch |
|----------+---------------+--------------+----------------+-----------+-------------|
| CCU      |         0.892 |        0.855 |          0.850 |     0.850 |       0.847 |
| CSRU     |         0.911 |        0.929 |          0.906 |     0.849 |       0.916 |
| MICU     |         0.841 |        0.826 |          0.824 |     0.814 |       0.831 |
| SICU     |         0.867 |        0.840 |          0.847 |     0.853 |       0.845 |
| TSICU    |         0.889 |        0.884 |          0.894 |     0.883 |       0.896 |
|----------+---------------+--------------+----------------+-----------+-------------|
| Macro    |         0.880 |        0.867 |          0.864 |     0.850 |       0.867 |
| Micro    |         0.881 |        0.866 |          0.864 |     0.854 |       0.866 |
#+TBLFM: $2=$2;%.3f::$3=$3;%.3f::$4=$4;%.3f::$5=$5;%.3f

- global pytorch 100 epochs other runs gives (signals huge variability from run
to run):
array([0.85215592, 0.93245018, 0.84186646, 0.86116114, 0.87931196,
       0.87338913, 0.87433607])
array([0.85676145, 0.90858243, 0.82498712, 0.86319526, 0.88819366,
       0.86834398, 0.86645781])

- moe pytorch 100 epochs:
array([0.86467094, 0.92366395, 0.82938577, 0.86105749, 0.86616517,
       0.86898866, 0.86866585])

- mtl pytorch
array([0.84332866, 0.90183424, 0.8326174 , 0.84083283, 0.85536183,
       0.85479499, 0.85851561])

- separate pytorch
array([0.81018889, 0.86179801, 0.82041411, 0.83377169, 0.8402231 ,
       0.83327916, 0.84139187])

- snapshot *
array([0.85379122, 0.9352808 , 0.84226075, 0.86646023, 0.88892013,
       0.87734263, 0.87744373])

- mtl pretrained 
array([0.83560272, 0.89560688, 0.82127601, 0.84821787, 0.86883671,
       0.85390804, 0.85102039])

- pmt global: this is doing better
array([0.86188426, 0.91687047, 0.82787795, 0.8556677 , 0.88713911,
       0.8698879 , 0.86915939])

